input_tmp.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:afs="http://mbtc.ru/afs"
                  xmlns:app="http://mbtc.ru/afs/application">
    <soapenv:Header/>
    <soapenv:Body>
        <afs:afsRequest>
            <afs:auth>
                <afs:login>0001ZZ000003</afs:login>
                <afs:password>1</afs:password>
            </afs:auth>
            <afs:action>matchupdate</afs:action>
            <afs:correlationId></afs:correlationId>
            <afs:ruleSetId>1</afs:ruleSetId>
            <afs:Application>
                <app:id>452521</app:id>
                <app:date>24.09.2013</app:date>
                <app:appState>1</app:appState>
                <app:client>
                    <app:id>1</app:id>
                    <app:fraud>0</app:fraud>
                    <app:surname>bpgbndpocjgafbleiaddnchjeljdfckfdpappanhoenclcdaefjfllhljmgmfmkf</app:surname>
                    <app:surname_1>bpgbndpocjgafbleiaddnchjeljdfckfdpappanhoenclcdaefjfllhljmgmfmkf</app:surname_1>
                    <app:firstname>nlhkgnplflfpcpphndcngcjcdbmebihoaeomjilfnejpnianebgohepnppkcamla</app:firstname>
                    <app:firstname_1>nlhkgnplflfpcpphndcngcjcdbmebihoaeomjilfnejpnianebgohepnppkcamla</app:firstname_1>
                    <app:firstname_2>nebopgfmbnpimplblfdfamdheojlhahonhdkomjdeahccklhafgohmcamnhbagfi</app:firstname_2>
                    <app:birthdate>03.09.1986</app:birthdate>
                    <app:applicantType>5</app:applicantType>
                </app:client>
                <app:client>
                    <app:id>2</app:id>
                    <app:fraud>0</app:fraud>
                    <app:surname>ejddoaimbjcpihadpjehlpcigpohbedmfpdalabokodpkgigmopmmfhlgoohigne</app:surname>
                    <app:surname_1>ejddoaimbjcpihadpjehlpcigpohbedmfpdalabokodpkgigmopmmfhlgoohigne</app:surname_1>
                    <app:firstname>fjibcgphoceiddojbiaogieeofopahfddlkcegknceoajpbjfijmhngcnkimkmio</app:firstname>
                    <app:firstname_1>fjibcgphoceiddojbiaogieeofopahfddlkcegknceoajpbjfijmhngcnkimkmio</app:firstname_1>
                    <app:firstname_2>jmlkeckkgdkdcahdjkbankgpagegjhflhgpemdhkjmmcbeookeikjapllmedhgka</app:firstname_2>
                    <app:middlename>lfampamfckpgdpcclkbhfjcnggofjhfjodepkkdooodfpeifpjcjhpainhmdppog</app:middlename>
                    <app:middlename_1>fjibcgphoceiddojbiaogieeofopahfddlkcegknceoajpbjfijmhngcnkimkmio
                    </app:middlename_1>
                    <app:middlename_2>fjibcgphoceiddojbiaogieeofopahfddlkcegknceoajpbjfijmhngcnkimkmio
                    </app:middlename_2>
                    <app:birthdate>04.09.1965</app:birthdate>
                    <app:newApplicant>1</app:newApplicant>
                    <app:internalId>654574</app:internalId>
                    <app:applicantType>1</app:applicantType>
                    <app:birthPlace>Москва</app:birthPlace>
                    <app:gender>1</app:gender>
                    <app:citizenship>RU</app:citizenship>
                    <app:maritalStatus>2</app:maritalStatus>
                    <app:childrenNumber>2</app:childrenNumber>
                    <app:education>7</app:education>
                    <app:prevSurname>feacccffahjndejbgakcagmkocekopbaambgpafbobjibdajhfilmihjjokepgia</app:prevSurname>
                    <app:prevSurname_1>feacccffahjndejbgakcagmkocekopbaambgpafbobjibdajhfilmihjjokepgia
                    </app:prevSurname_1>
                    <app:prevFirstname>fjibcgphoceiddojbiaogieeofopahfddlkcegknceoajpbjfijmhngcnkimkmio
                    </app:prevFirstname>
                    <app:prevFirstname_1>fjibcgphoceiddojbiaogieeofopahfddlkcegknceoajpbjfijmhngcnkimkmio
                    </app:prevFirstname_1>
                    <app:prevFirstname_2>jmlkeckkgdkdcahdjkbankgpagegjhflhgpemdhkjmmcbeookeikjapllmedhgka
                    </app:prevFirstname_2>
                    <app:prevMiddlename>lfampamfckpgdpcclkbhfjcnggofjhfjodepkkdooodfpeifpjcjhpainhmdppog
                    </app:prevMiddlename>
                    <app:prevMiddlename_1>fjibcgphoceiddojbiaogieeofopahfddlkcegknceoajpbjfijmhngcnkimkmio
                    </app:prevMiddlename_1>
                    <app:prevMiddlename_2>fjibcgphoceiddojbiaogieeofopahfddlkcegknceoajpbjfijmhngcnkimkmio
                    </app:prevMiddlename_2>
                    <app:incomeType>1</app:incomeType>
                    <app:confirmedIncome>65000</app:confirmedIncome>
                    <app:unconfirmedIncome>5000</app:unconfirmedIncome>
                    <app:spouseId>1</app:spouseId>
                    <app:doc>
                        <app:fraud>0</app:fraud>
                        <app:docType>21</app:docType>
                        <app:seriesNumber>dfpibbdnmofkepomloifdghpbodolimnckidpddjjemoecfpnaeahllphnmbgccm
                        </app:seriesNumber>
                        <app:issueDate>11.09.2013</app:issueDate>
                    </app:doc>
                    <app:doc>
                        <app:fraud>3</app:fraud>
                        <app:docType>21</app:docType>
                        <app:seriesNumber>leejjafomkfmlccokcimkegmhpehedcmjdpnbkbkgfjklmmljmgefpfbfnaikdak
                        </app:seriesNumber>
                        <app:issueDate>07.08.2013</app:issueDate>
                    </app:doc>
                    <app:address>
                        <app:fraud>0</app:fraud>
                        <app:addrType>1</app:addrType>
                        <app:country>RU</app:country>
                        <app:region>77</app:region>
                        <app:city>Москва</app:city>
                        <app:street>Первомайская</app:street>
                        <app:house>12</app:house>
                        <app:block>2</app:block>
                        <app:building>а</app:building>
                        <app:apartment>7</app:apartment>
                    </app:address>
                    <app:address>
                        <app:addrType>2</app:addrType>
                        <app:startDate>24.09.2013</app:startDate>
                    </app:address>
                    <app:phone>
                        <app:fraud>3</app:fraud>
                        <app:phoneType>2</app:phoneType>
                        <app:number>epnadigkjkcjbjfapdnhdpoonjheigcdgkdbejndnbfoagnofckjlnoocciblegd</app:number>
                    </app:phone>
                    <app:phone>
                        <app:fraud>3</app:fraud>
                        <app:phoneType>4</app:phoneType>
                        <app:number>fmcllmeafpiclobkchicnpjeiincbacpcadbldokfiglaaelgbcjelpdeeoggaaa</app:number>
                    </app:phone>
                    <app:employer>
                        <app:fraud>4</app:fraud>
                        <app:name>ЗАО Иввновр</app:name>
                        <app:shortName>ЗОА ОЛ</app:shortName>
                        <app:sector>1039</app:sector>
                        <app:position>Военный</app:position>
                        <app:duration>50</app:duration>
                    </app:employer>
                    <app:img>
                        <app:id>8574b835-ea95-4cf9-9028-3bbaced07422</app:id>
                    </app:img>
                </app:client>
                <app:details>
                    <app:creditType>1</app:creditType>
                    <app:receiptChannel>1</app:receiptChannel>
                    <app:totalCredit>800000</app:totalCredit>
                    <app:currency>RUB</app:currency>
                    <app:initialInstalment>500000</app:initialInstalment>
                    <app:pledgeFlag>1</app:pledgeFlag>
                    <app:pledgeValue>1500000</app:pledgeValue>
                    <app:productFlag>1</app:productFlag>
                    <app:productValue>1500000</app:productValue>
                    <app:productModel>Honda</app:productModel>
                    <app:creditDate>24.09.2013</app:creditDate>
                    <app:creditDuration>60</app:creditDuration>
                </app:details>
                <app:memberCode>0001ZZ000000</app:memberCode>

            </afs:Application>
        </afs:afsRequest>
    </soapenv:Body>
</soapenv:Envelope>